---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RevolutionFailures.ProfileCrossesRevolutionAxis
source: html/5a4be39d-5915-df82-2c0b-56eb676ad3df.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RevolutionFailures.ProfileCrossesRevolutionAxis Property

The profile must not cross the axis of revolution.

## Syntax (C#)
```csharp
public static FailureDefinitionId ProfileCrossesRevolutionAxis { get; }
```